//Завдання 2: Виконайте попереднє завдання але використовуючи конструкцію switch/case

//Студентам потрібно визначити свій рівень успішності за оцінками, які вони отримали за курс. Напишіть програму, яка допоможе студентам визначити свій рівень успішності на основі середньої оцінки.
// Створіть змінну averageGrade і присвойте їй середню оцінку студента (від 0 до 100).
// За допомогою конструкції if else, визначте та виведіть у консоль рівень успішності студента:
// Якщо середня оцінка менше 60, вивести "Незадовільно".
// Якщо середня оцінка від 60 до 70 (включно), вивести "Задовільно".
// Якщо середня оцінка від 71 до 80 (включно), вивести "Добре".
// Якщо середня оцінка від 81 до 90 (включно), вивести "Дуже добре".
// Якщо середня оцінка від 91 до 100 (включно), вивести "Відмінно".

const averageGrade = 80;

switch (true) {
    case (averageGrade >= 91):
        console.log("Відмінно");
        break;
    case (averageGrade >= 81):
        console.log("Дуже добре");
        break;
    case (averageGrade >= 71):
        console.log("Добре");
        break;
    case (averageGrade >= 61):
        console.log("Задовільно");
        break;
    default:
        console.log("Незадовільно")

}